print("hello data!")
3+2

100/7.2
x <- 10
y <- c(1,2,3)
z <- 1:10
z

a <- seq(1,100,4)
a

exam <- 5
Exam <- 55
exam_1 <- 22
.exam_2 <- 256
.ex <- 2
.ex1 <- 2
.ex1
#http://ds.sumeun.org/?p=1046
#.이후 숫자는 올수 없음
#.OOO은 R 내부 변수로 지정 따라서 Values에는 표시되지 않음
e3 <- 5
a <- c(1,2,3,4,5)
max(a)
min(a)
print("jam")
#출력의 [1]은 한줄의 첫원소의 인덱스

x <- c(1,2,3)
y <- c("a","b","c")
z <- c(TRUE,TRUE,FALSE,TRUE)
x
y
z

w <-c(1,2,3,"a","b","c")
# vector는 단일 자료형 -> 숫자는 문자형으로 형변환
v1 <- 30:50
v1
v2 <- c(1,3,5,7,9,10:20,30:50)
v2
v0 <- 1:100
v0

#seq
v3 <- seq(1,100,2)
v3
v4 <- seq(0.1,10,0.1)
v4

v4_1 <- seq(from=-5, to=5,by=1)
v4_1

v4_2 <- seq(-5,5,1)
v4_2

#rep
v5 <- rep(1,times = 10)
v5

v6 <- rep(1:10,times = 5)
v6

v6_1 <- rep(1:10,each = 5)
v6_1

v6_2 <- rep(1:10,each = 5,times=5)
v6_2

v6_3 <- rep(1:10,times=5,each = 5)
v6_3

v7 <- rep(c("a","b","c","d"),each=5)
v7


# names()

score <- c(90,85,70)
score
names(score) <- c("John","Tom", "Jane")
score
score[1]

score["John"]

score[c("John","Tom")]

score[1:2]

score[seq(1,3,2)]
seq(1,3,2)



# 벡터에서 값 추출
x <- c(2,4,7,10,9,10,5,1,8,2)
x[2]
x[1:3]
x[c(1,3,5,7,9)]
x[seq(1,12,2)]


#length
length(x)


x
#2  4  7 10  9 10  5  1  8  2

#값 제거
x[-2] # 출력만 되고 해당값에 적용은 안됨
#2  7 10  9 10  5  1  8  2
x[-c(1:5)]
#10  5  1  8  2
x
#2  4  7 10  9 10  5  1  8  2
unique(x) # 중복제거
#2  4  7 10  9  5  1  8

numeric(20)# 0반복

x <- -10:10
x
x+3
x*2
x/10
x <- -5:5
x
y <- -5:5
y

x+y
x*y
x/y

#NA와 NaN 차이 
#NA :Not Available 결측값 값이 없음
#NaN : Not a Number 숫자로 표현 못함 
#Inf : Infinite 무한대

v <- seq(5,100,by=5)
v
matrix(v, ncol = 4)
matrix(v, nrow = 4)
matrix(v, ncol = 4,nrow = 4)
a <- matrix(v, ncol = 4,nrow = 4,byrow=T)
"
     [,1] [,2] [,3] [,4]
[1,]    5   30   55   80
[2,]   10   35   60   85
[3,]   15   40   65   90
[4,]   20   45   70   95
[5,]   25   50   75  100

"


a
# [,1] [,2] [,3] [,4]
# [1,]    5   10   15   20
# [2,]   25   30   35   40
# [3,]   45   50   55   60
# [4,]   65   70   75   80
5*5+10*25+15*45+20*65
a*a
# [,1] [,2] [,3] [,4]
# [1,]   25  100  225  400
# [2,]  625  900 1225 1600
# [3,] 2025 2500 3025 3600
# [4,] 4225 4900 5625 6400


a%*%a
# [,1]  [,2]  [,3]  [,4]
# [1,]  2250  2500  2750  3000
# [2,]  5050  5700  6350  7000
# [3,]  7850  8900  9950 11000
# [4,] 10650 12100 13550 15000
a%o%a

12%/%3
# [,1] [,2] [,3] [,4]
# [1,]    5   30   55   80
# [2,]   10   35   60   85
# [3,]   15   40   65   90
# [4,]   20   45   70   95
# [5,]   25   50   75  100

# ctrl+shift+c 여러줄 주석